app/controllers/api/messages_controller.rb

    def index
      greeting = Message.order(Arel.sql('RANDOM()')).first
---
SELECT "messages".* FROM "messages" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]